app/views/users/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "comments" ON "posts"."id" = "comments"."post_id" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---

<% @user.posts.each do |post| %>